---
kind: other
id: Methods.T:Autodesk.Revit.DB.ReferenceArrayIterator
source: html/d49d9004-c7ae-910a-29d3-6cf2d150ecdb.htm
---
# ReferenceArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.